<a href="https://colab.research.google.com/github/NguyenTien-beep/DAP391m/blob/main/lab01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
print(titanic.info())
print(titanic.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  1309 non-null   int64
 1   pclass        1309 non-null   int64
 2   survived      1309 non-null   int64
 3   name          1309 non-null   object
 4   sex           1309 non-null   int64
 5   age           1046 non-null   float64
 6   sibsp         1309 non-null   int64
 7   parch         1309 non-null   int64
 8   ticket        1309 non-null   object
 9   fare          1308 non-null   float64
 10  cabin         295 non-null    object
 11  embarked      1307 non-null   object
 12  boat          486 non-null    object
 13  body          121 non-null    float64
 14  home.dest     745 non-null    object
dtypes: float64(3), int64(6), object(6)
memory usage: 153.5+ KB
None
   passenger_id  pclass  survived  \
0             1       1         1
1             2       1         1
2             3       1         0
3             4       1         0
4             5       1         0

                                              name  sex      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton    1  29.0000      0
1                   Allison, Master. Hudson Trevor    0   0.9167      1
2                     Allison, Miss. Helen Loraine    1   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    0  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    1  25.0000      1

   parch  ticket      fare    cabin embarked boat   body  \
0      0   24160  211.3375       B5        S    2    NaN
1      2  113781  151.5500  C22 C26        S   11    NaN
2      2  113781  151.5500  C22 C26        S  NaN    NaN
3      2  113781  151.5500  C22 C26        S  NaN  135.0
4      2  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

#Exercise 1.2

In [ ]:
embarked_dict = {'C': 'Cherbourg', 'Q': 'Queenstown', 'S': 'Southampton'}
titanic['embarked'] = titanic['embarked'].map(embarked_dict)
titanic['embarked'] = pd.Categorical(
    titanic['embarked'],
    categories=['Cherbourg', 'Queenstown', 'Southampton'],
    ordered=False
)
print(titanic['embarked'].unique())
print(titanic['embarked'].value_counts())

[NaN]
Categories (3, object): ['Cherbourg', 'Queenstown', 'Southampton']
embarked
Cherbourg      0
Queenstown     0
Southampton    0
Name: count, dtype: int64

In [ ]:
sex_dict = {'female': 'Female', 'male': 'Male'}
titanic['sex'] = titanic['sex'].map(sex_dict)
titanic['sex'] = pd.Categorical(titanic['sex'], categories=['Female', 'Male'], ordered=False)
print(titanic['sex'].unique())
print(titanic['sex'].value_counts())

[NaN]
Categories (2, object): ['Female', 'Male']
sex
Female    0
Male      0
Name: count, dtype: int64

In [ ]:
survived_dict = {1: 'Yes', 0: 'No'}
titanic['survived'] = titanic['survived'].map(survived_dict)
titanic['survived'] = pd.Categorical(titanic['survived'], categories=['Yes', 'No'], ordered=False)
print(titanic['survived'].unique())
print(titanic['survived'].value_counts())

['Yes', 'No']
Categories (2, object): ['Yes', 'No']
survived
No     809
Yes    500
Name: count, dtype: int64

In [ ]:
pclass_dict = {1: '1st', 2: '2nd', 3: '3rd'}
titanic['pclass'] = titanic['pclass'].map(pclass_dict)
titanic['pclass'] = pd.Categorical(
    titanic['pclass'],
    categories=['1st', '2nd', '3rd'],
    ordered=True
)
print(titanic['pclass'].unique())
print(titanic['pclass'].value_counts())

['1st', '2nd', '3rd']
Categories (3, object): ['1st' < '2nd' < '3rd']
pclass
3rd    709
1st    323
2nd    277
Name: count, dtype: int64